In [1]:
import pandas as pd
import numpy as np

In [10]:
df=pd.read_csv("supershops.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [12]:
x=df.drop('Profit',axis=1)
y=df[['Profit']]

In [13]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [14]:
y.head()

      Profit
0  192261.83
1  191792.06
2  191050.39
3  182901.99
4  166187.94

In [16]:
x1=x.copy()
x2=x.copy()
x3=x.copy()
x4=x.copy()
x5=x.copy()
x6=x.copy()
x7=x.copy()
x8=x.copy()

# Normalization

# Min_Max_Scaler(Manually)

In [17]:
from sklearn.preprocessing import MinMaxScaler

In [18]:
min_max= MinMaxScaler()

In [32]:
x1[['Marketing Spend']]=min_max.fit_transform(x1[['Marketing Spend']])

In [33]:
x1[['Administration']]=min_max.fit_transform(x1[['Administration']])

In [34]:
x1[['Transport']]=min_max.fit_transform(x1[['Transport']])
x1.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Min_max_Scaler Using for Loop

In [27]:
for column in x2.columns:
    if pd.api.types.is_numeric_dtype(x2[column]):
        x2[column]=min_max.fit_transform(x2[[column]])
    else:
        continue
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Standardizations  Manually

In [28]:
from sklearn.preprocessing import StandardScaler

In [29]:
std=StandardScaler()

In [30]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [35]:
x3[['Marketing Spend']]= std.fit_transform(x3[['Marketing Spend']])

In [37]:
x3[['Administration']]= std.fit_transform(x3[['Administration']])

In [38]:
x3[['Transport']]= std.fit_transform(x3[['Transport']])
x3.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# Standard Scaler Using For Loop

In [39]:
x4.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [40]:
for column in x4.columns:
    if pd.api.types.is_numeric_dtype(x4[column]):
        x4[column]=std.fit_transform(x4[[column]])
    else:
        continue
x4.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# Maximum Absolute Scaler(MaxAbsScaler)

In [41]:
from sklearn.preprocessing import MaxAbsScaler

In [42]:
mas=MaxAbsScaler()

In [43]:
x5.head(3)

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur

In [44]:
x5[['Marketing Spend']]=mas.fit_transform(x5[['Marketing Spend']])

In [45]:
x5[['Administration']]=mas.fit_transform(x5[['Administration']])

In [46]:
x5[['Transport']]=mas.fit_transform(x5[['Transport']])

In [47]:
x5.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.749527   1.000000    Dhaka
1         0.983359        0.828805   0.940893      Ctg
2         0.927985        0.553781   0.864664  Rangpur
3         0.873136        0.649738   0.812235    Dhaka
4         0.859438        0.500378   0.776136  Rangpur

# MaxAbsScaler Using For Loop

In [49]:
for column in x6.columns:
    if pd.api.types.is_numeric_dtype(x6[column]):
        x6[column]=mas.fit_transform(x6[[column]])
    else:
        continue
x6.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.749527   1.000000    Dhaka
1         0.983359        0.828805   0.940893      Ctg
2         0.927985        0.553781   0.864664  Rangpur
3         0.873136        0.649738   0.812235    Dhaka
4         0.859438        0.500378   0.776136  Rangpur

# Robust Scaler  Manually

In [50]:
from sklearn.preprocessing import RobustScaler

In [51]:
rs=RobustScaler()

In [52]:
x7.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [53]:
x7[['Marketing Spend']]=rs.fit_transform(x7[['Marketing Spend']])

In [54]:
x7[['Administration']]=rs.fit_transform(x7[['Administration']])

In [55]:
x7[['Transport']]=rs.fit_transform(x7[['Transport']])

In [56]:
x7.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur

In [57]:
for column in x8.columns:
    if pd.api.types.is_numeric_dtype(x8[column]):
        x8[column]=rs.fit_transform(x[[column]])
    else:
        continue
x8.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur